<template>
  <div id="back" class="agreement" style="padding-right: 5%; padding-left: 5%">
    <h1 id="p-top">利用規約</h1>
    <div id="body">
      <p>
        この利用規約（以下、「本規約」といいます。）は、遊橋研究室（以下、「当研究室」といいます。）が提供するサービスの利用条件を定めるものです。本サービスの利用者の皆さま（以下、「ユーザー」といいます。）には、本規約にしたがって、本サービスをご利用いただきます。
      </p>

      <ul style="list-style: none">
        <li><a href="#cf1st">第1章総則</a></li>
        <li><a href="#cf2nd">第2章プライバシーポリシー</a></li>
        <li><a href="#cf3rd">第3章コミュニティーサービスに関する規則</a></li>
        <li><a href="#cf4th">第4章ソフトウエアに関する規則</a></li>
      </ul>
    </div>

    <section id="cf1st" class="anchor-adjust __stuff">
      <h2>第1章 総則</h2>
      <ol class="wraplist">
        <li>
          <h4>当研究室のサービスのご利用</h4>
          <p>
            本規約にご同意いただくことによって、当研究室のサービスをご利用いただくことができます。
          </p>
        </li>

        <li>
          <h4>サービス内容の保証および変更</h4>
          <p>
            本サービスは、プラットフォームビジネス実践教育を目的として開発を行っております。したがって、当研究室は、提供するサービスの内容について瑕疵（かし）やバグがないことの保証はいたしかねます。
            また当研究室は、ユーザーにあらかじめ通知することなくサービスの内容や仕様を変更したり、提供を停止したり中止したりすることができるものとします。
          </p>
        </li>

        <li>
          <h4>サービスの利用制限</h4>
          <p>
            当研究室は、サービスのご利用を静岡大学在学生に限定するなど、利用に際して条件を付すことができるものとします。
            また、当研究室は反社会的勢力の構成員（過去に構成員であった方を含みます）およびその関係者の方や、サービスを悪用したり、第三者に迷惑をかけたりするようなユーザーに対してはご利用をお断りしています。
          </p>
        </li>

        <li>
          <h4>IDの登録情報</h4>
          <p>
            IDを登録していただく場合、（1）静岡大学浜松キャンパス在学生であることを証明していただけること、(2)真実かつ正確な情報を登録していただくこと、（3）登録内容が最新となるようユーザーご自身で適宜修正していただくことがユーザーの義務となります。
          </p>
        </li>

        <li>
          <h4>IDおよびパスワード等に関するユーザーの責任</h4>
          <p>
            ユーザーを特定する所定の認証方法によりログインされた場合には、当研究室は、当該ユーザーご自身によるご利用であるとみなします。
          </p>
        </li>

        <li>
          <h4>サービス利用にあたっての順守事項</h4>
          <p>
            当研究室のサービスのご利用に際しては以下に定める行為（それらを誘発する行為や準備行為も含みます）を禁止いたします。
          </p>
          <ul style="list-style: none">
            <li>（1）日本国またはご利用の際にユーザーが所在する国・地域の法令に違反する行為</li>
            <li>
              （2）社会規範・公序良俗に反するものや、他人の権利を侵害し、または他人の迷惑となるようなものを、投稿、掲載、開示、提供または送信（以下これらを総称して「投稿など」といいます）したりする行為
            </li>
            <li>
              （3）ほかのユーザーの使用するソフトウエア、ハードウエアなどの機能を破壊したり、妨害したりするようなプログラムなどの投稿などをする行為
            </li>
            <li>（4）当研究室のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
            <li>
              （5）当研究室のサービス、当研究室の配信する広告、または、当研究室のサイト上で提供されているサービス、広告を妨害する行為
            </li>
            <li>
              （6）ほかのユーザーの個人情報や履歴情報および特性情報（第2章プライバシーポリシーにて定義されます）などをユーザーに無断で収集したり蓄積したりする行為
            </li>
            <li>
              （7）サービスを、提供の趣旨に照らして本来のサービス提供の目的とは異なる目的で利用する行為
            </li>
            <li>（8）ほかのユーザーのIDを使用してサービスを利用する行為</li>
            <li>
              （9）手段のいかんを問わず他人からIDやパスワードを入手したり、他人にIDやパスワードを開示したり提供したりする行為
            </li>
            <li>
              （10）当研究室のサービスに関連して、反社会的勢力に直接・間接に利益を提供する行為
            </li>
          </ul>
        </li>

        <li>
          <h4>当研究室のサービスなどの再利用の禁止</h4>
          <p>
            ユーザーが、当研究室のサービスやそれらを構成するデータを、当該サービスの提供目的を超えて利用した場合、当研究室は、それらの行為を差し止める権利ならびにそれらの行為によってユーザーが得た利益相当額を請求する権利を有します。
          </p>
        </li>

        <li>
          <h4>当研究室に対する補償</h4>
          <p>
            ユーザーの行為が原因で生じたクレームなどに関連して当研究室に費用が発生した場合または当研究室が賠償金などの支払を行った場合、ユーザーは当研究室が支払った費用や賠償金など（当研究室が支払った弁護士費用を含みます）を負担するものとします。
          </p>
        </li>

        <li>
          <h4>ユーザーのデータおよびコンテンツの取扱い</h4>
          <p>
            ユーザーが当研究室の管理するサーバーに保存しているデータについて、当研究室ではバックアップの義務を負わないものとし、ユーザーご自身においてバックアップを行っていただくものとします。
            なお、当研究室のサービスの保守や改良などの必要が生じた場合には、当研究室はユーザーが当研究室の管理するサーバーに保存しているデータを、サービスの保守や改良などに必要な範囲で複製等することができるものとします。
            また、電子掲示板など、不特定または多数のユーザーがアクセスできるサービスに対してユーザーが投稿などをしたコンテンツについては、ユーザーまたは当該コンテンツの著作権者に著作権が帰属します。
            当該コンテンツについて、ユーザーは当研究室に対して、日本の国内外で無償かつ非独占的に利用（複製、上映、公衆送信、展示、頒布、譲渡、貸与、翻訳、翻案、出版を含みます）する権利を期限の定めなく許諾（サブライセンス権を含みます）したものとみなします。
            なお、ユーザーは著作者人格権を行使しないものとします。
          </p>
        </li>

        <li>
          <h4>広告掲載について</h4>
          <p>
            当研究室は、提供するサービスやソフトウエアに当研究室または当研究室に掲載依頼をした第三者の広告を掲載することができるものとします。
          </p>
        </li>

        <li>
          <h4>投稿などの削除、サービスの利用停止、ID削除について</h4>
          <p>
            当研究室は、提供するサービスを適正に運営するために、以下の場合にはあらかじめ通知することなく、データやコンテンツを削除したり、サービスの全部または一部の利用をお断りしたり、ユーザーのIDを削除したりするといった措置を講じることができるものとします。
            また、ユーザーが複数のIDを登録されている場合には、それらすべてのIDに対して措置がとられる場合があります。
          </p>
          <ul style="list-style: none">
            <li>
              （1）ユーザーが本規約に定められている事項に違反した場合、もしくはそのおそれがあると当研究室が判断した場合
            </li>
            <li>
              （2）IDが反社会的勢力またはその構成員や関係者によって登録または使用された場合、もしくはそのおそれがあると当研究室が判断した場合
            </li>
            <li>
              （3）その他、ユーザーとの信頼関係が失われた場合など、当研究室とユーザーとの契約関係の維持が困難であると当研究室が判断した場合
            </li>
          </ul>
        </li>

        <li>
          <h4>免責事項</h4>
          <p>
            当研究室の債務不履行責任は、当研究室の故意または重過失によらない場合には免責されるものとします。
          </p>
        </li>

        <li>
          <h4>利用規約の変更について</h4>
          <p>
            当研究室が必要と判断した場合には、ユーザーにあらかじめ通知することなくいつでも本規約を変更することができるものとします。
            ただし、ご利用いただいているユーザーに大きな影響を与える場合には、あらかじめ合理的な事前告知期間を設けるものとします。
          </p>
        </li>

        <li>
          <h4>権利義務などの譲渡の禁止</h4>
          <p>
            ユーザーは、本規約に基づくすべての契約について、その契約上の地位およびこれにより生じる権利義務の全部または一部を、当研究室の書面による事前の承諾なく第三者に譲渡することはできません。
          </p>
        </li>

        <li>
          <h4>準拠法、裁判管轄</h4>
          <p>
            本規約の成立、効力発生、解釈にあたっては日本法を準拠法とします。
            また、当研究室のサービス（掲載内容や広告などを含む）、ソフトウエアに起因または関連して当研究室とユーザーとの間で生じた紛争については東京地方裁判所を第一審の専属的合意管轄裁判所とします。
          </p>
        </li>

        <li>
          <h4>利用規約の適用制限について</h4>
          <p>
            本規約の規定がユーザーとの本規約に基づく契約に適用される関連法令に反するとされる場合、当該規定は、その限りにおいて、当該ユーザーとの契約には適用されないものとします。
            ただし、この場合でも、本規約のほかの規定の効力には影響しないものとします。
          </p>
        </li>

        <p class="top"><a href="#p-top">▲このページのトップへ</a></p>
      </ol>
    </section>

    <section id="cf2nd" class="anchor-adjust __stuff">
      <h2>第2章 プライバシーポリシー</h2>
      <p>
        当研究室がプライバシーに関連する情報を取り扱う際の基本方針（プライバシーポリシー）は、以下のとおりです。
      </p>
      <p>
        本プライバシーポリシーは、当研究室が取り扱う、個人としてのユーザーを直接的または間接的に識別できるすべての情報（以下「パーソナルデータ」といいます）について適用されます。「パーソナルデータ」のうち、「個人情報」とは「個人情報の保護に関する法律」に定義されている「個人情報」をいいます。
      </p>

      <ol class="wraplist">
        <li>
          <h4>パーソナルデータの取得</h4>
          <p>当研究室は、以下の場合にパーソナルデータを取得させていただきます。</p>
          <ul style="list-style: none">
            <li>（1）端末操作を通じてユーザーにご入力いただく場合</li>
            <li>（2）ユーザーから直接または書面等の媒体を通じてご提供いただく場合</li>
            <li>
              （3）ユーザーによるサービス、広告、コンテンツ（以下これらをまとめて「サービス等」（*）といいます）の利用・閲覧に伴って自動的に送信される場合
            </li>
            <li>
              （4）上記の他、ユーザーの同意を得た第三者から提供を受ける場合など、適法に取得する場合
            </li>
          </ul>
          <p>* サービス等は、個人のユーザー向けのサービス、商品、広告、コンテンツに限りません。</p>
        </li>

        <li>
          <h4>パーソナルデータの利用目的</h4>
          <p>当研究室は、以下のことを行うためパーソナルデータを利用させていただきます。</p>
          <ul style="list-style: none">
            <li>（1）ユーザーに適したサービス等をご提供するため</li>
            <li>（2）ユーザーからのお問い合わせに対応するため</li>
            <li>（3）ユーザーにサービス等に関するお知らせをするため</li>
            <li>
              （4）サービス等を安全にご提供するため。これには、利用規約に違反しているユーザーを発見して当該ユーザーに通知をしたり、サービス等を悪用した詐欺や不正アクセスなどの不正行為を調査・検出・予防したり、これらに対応することが含まれます
            </li>
            <li></li>
            <li>（5）サービス等の改善および新たなサービス等を検討するため</li>
            <li>（6）サービス等のご利用状況等を調査、分析するため</li>
            <li>（7）当研究室推進の調査、研究を目的とした分析を行うため</li>
          </ul>
          <p>
            上記にかかわらず、当研究室が第三者からパーソナルデータの提供を受ける際に、当該パーソナルデータの利用目的について別途定めがある場合は、その定めに従い当該パーソナルデータを利用します。
          </p>
        </li>

        <li>
          <h4>セキュリティについて</h4>
          <p>当研究室は、本プライバシーポリシーに従って、パーソナルデータを適切に取り扱います。</p>
        </li>

        <p class="top"><a href="#p-top">▲このページのトップへ</a></p>
      </ol>
    </section>

    <section id="cf3rd" class="anchor-adjust __stuff">
      <h2>第3章 コミュニティーサービスに関する規則</h2>
      <ol class="wraplist">
        <li>
          <h4>当研究室のコミュニティーサービスとは</h4>
          <p>
            コミュニティーサービスとは、ユーザーご自身によるコンテンツの投稿などができる機能や、ユーザー同士で交流できる機能を有するサービス全般をいいます。
          </p>
        </li>

        <li>
          <h4>コミュニティーサービスに投稿などをされたコンテンツの取扱い</h4>
          <p>
            ユーザーがコミュニティーサービスに投稿などをされたコンテンツの取扱いは原則として第1章総則の定めに従いますが、複数のユーザーの手によって記述、修正、削除などがなされてひとつの情報が形成されていく機能を提供しているサービスにおいては、ユーザーが投稿などをされたコンテンツをほかのユーザーが自由に改変そのほかの利用を行うことを承認し、著作権、著作者人格権そのほかの権利を行使しないことをユーザーにお約束いただいたものとみなします。
          </p>
        </li>

        <li>
          <h4>コンテンツの公開制限機能</h4>
          <p>
            コミュニティーサービスの中にはユーザーが投稿などをしたコンテンツの公開対象を限定する機能を提供しているものもありますが、当研究室は本規約の順守状況などを確認する目的で必要に応じてそのコンテンツの内容を確認させていただくことがあります。
          </p>
          <p>
            また、当該機能の運用には万全を期しておりますが、運用上の事情により、やむを得ず当該コンテンツが公開対象範囲外の方に公開されてしまう可能性がありますので、あらかじめそのことにご同意のうえで、当該機能をご利用いただくものとします。
          </p>
        </li>
        <p class="top"><a href="#p-top">▲このページのトップへ</a></p>
      </ol>
    </section>

    <section id="cf4th" class="anchor-adjust __stuff">
      <h2>第4章 ソフトウエアに関する規則</h2>
      <ol class="wraplist">
        <li>
          <h4>ソフトウエア</h4>
          <p>
            このガイドラインは当研究室の提供するソフトウエアに関して適用されるガイドラインです。
          </p>
        </li>

        <li>
          <h4>利用上の制約</h4>
          <p>
            当研究室は、ユーザーへの通知を行うことなく、自己の裁量に基づいていつでもソフトウエアや特定の機能に関して利用の制約（たとえば、ソフトウエアを介して当研究室のサービスへのアクセス回数、アクセス時間などについて制限することなど）を行うことができるものとします。
          </p>
          <p>
            また、ソフトウエアに関するサポートや修正版（アップデート版を含みます）の提供は、当研究室の裁量に基づいて行い、またあらかじめユーザーへ通知を行うことなく、それらを終了する場合があります。
          </p>
        </li>

        <li>
          <h4>ソフトウエアに関する順守事項</h4>
          <p>ソフトウエアのご利用にあたっては、以下の行為が禁止されます。</p>
          <ul style="list-style: none">
            <li>
              （1）リバースエンジニアリング、逆アセンブルを行うこと、また、その他の方法でソースコードを解読すること
            </li>
            <li>
              （2）人の生命・身体または財産に重大な危険をおよぼすおそれのある設備などを制御するためなどにソフトウエアを利用すること
            </li>
            <li>
              （3）対価を受ける目的でソフトウエアまたは開発ソフトウエアを自ら利用し、または第三者に利用させること
            </li>
            <li>
              （4）書面その他当研究室が指定する方法による事前の承諾を得ることなく、ソフトウエアを販売、賃貸、使用許諾すること
            </li>
            <li>
              （5）合理的に必要相当な数を超える利用、乱用などを行い、または、ソフトウエアの使用について当研究室が定める指示などを順守しない用法でソフトウエアを利用すること
            </li>
            <li>
              （6）ソフトウエアを提供する目的に外れた態様でソフトウエアを利用したり、当研究室が不適当とみなした方法・態様でソフトウエアを利用すること
            </li>
          </ul>
        </li>

        <li>
          <h4>権利関係</h4>
          <p>
            ソフトウエアおよび実行ファイル、その他ソフトウエアに関する一切の権利は、当該ソフトウエアの著作権を有する当研究室に帰属します。
          </p>
        </li>

        <li>
          <h4>無保証</h4>
          <p>
            当研究室は提供するソフトウエアについて、第1章総則の定めのとおり、エラーやバグ、論理的誤り、不具合、中断その他の瑕疵（かし）がないこと、信頼性、正確性、完全性、有効性について一切保証しておりません。
          </p>
          <p>
            ソフトウエアは明示または黙示の有無にかかわらず、当研究室がその提供時において保有する状態で提供するものであり、特定の目的への適合性、有用性（有益性）、セキュリティ、権原および非侵害性について一切保証しておりません。
          </p>
        </li>

        <p class="date">（2020年11月12日制定）</p>
        <p class="top"><a href="#p-top">▲このページのトップへ</a></p>
      </ol>

      <ul style="list-style: none">
        <li>提供元 静岡大学情報学部・遊橋研究室</li>
        <li>静岡県浜松市中区城北3-5-1浜松キャンパス情報学部2号館</li>
        <li>
          <a href="http://www.yuhashi-lab.net/">http://www.yuhashi-lab.net/</a>
        </li>
      </ul>
    </section>
  </div>
</template>

<style scoped>
.agreement {
  color: black;
  width: 360px;
  height: 1600px;
  margin: auto;
  background-color: white;
  overflow: auto;
  opacity: 0.5;
  border-radius: 10px;
}
</style>
